{
  "command.target.player.only": "The target of this command should be the a player",
  "command.target.entity.only": "The target of this command should be the an entity",
  "commands.toggle.theme": "Successfully switched the theme style of the dialog box",
  "commands.skip.dialogues": "Successfully jumped to the %s sentence of the %s group",
  "commands.set.max.trigger.count": "Successfully set maximum trigger count of %s to %s",
  "commands.reset.max.trigger.count": "Successfully reset maximum trigger count for all dialogues",

  "chatbox.configuration.config": "ChatBox Mod Config Screen",
  "chatbox.configuration.historical_scroll_speed": "The speed of the historical record interface scroll wheel",
  "chatbox.configuration.sound_interruption_enabled": "Whether to interrupt currently playing sound when no new sound is available",
  "chatbox.configuration.is_screen":"Whether it is a screen theme dialog (In screen theme, players can only click options; in non-screen theme, players can move while the dialog is displayed)",

  "chatbox.key.right_click": "Confirm",
  "chatbox.key.scroll": "Toggle options",
  "chatbox.key.esc": "Close dialog",
  "chatbox.key.ctrl": "Fast-forward dialogue",

  "chatbox.test.name.1": "Inaba Meguru",
  "chatbox.test.text.1": "This module features dialog boxes, options, character illustrations, and a history button. Dialog text supports formatting codes like §1color§2coding§3, §f§lbold, §oitalic§r, etc. The placeholder @@s will be replaced with the player's ID: @s. Illustrations can display custom images, item textures, and player avatars.",
  "chatbox.test.text.2": "Options support hiding and locking functionality, with customizable tooltips displayed on hover.",
  "chatbox.test.text.3": "Custom commands can be triggered when entering a dialog or clicking an option.",
  "chatbox.test.text.4": "Each dialog line can be configured with custom background music. Compared to playing music via commands when entering a dialog, this configuration automatically stops when moving to the next line, making it more suitable for voice acting.",
  "chatbox.test.text.5": "For custom images in illustrations, the module provides three preset animations: Fade In, Slide In, and Bounce. You can also configure the renderOrder parameter to decide whether illustrations appear above or below the dialog box.",
  "chatbox.test.text.6": "Beyond the three preset animations, all illustrations can be configured with custom animations. The animations use frame-by-frame animation, allowing you to configure changes in size, transparency, and position over multiple time periods, with options for looping playback.",
  "chatbox.test.text.7": "The module provides multilingual support for dialog text. You can configure whether the dialog can be closed with ESC, freeze game time in single-player mode to advance the plot, and whether the history interface allows dialog backtracking.",
  "chatbox.test.text.8": "You can configure how many times a dialog can be triggered, and commands are provided to debug these trigger counts.",
  "chatbox.test.text.9": "The module supports custom advancement triggers to open dialogs.",
  "chatbox.test.text.10": "Custom background images can be configured for the bottom layer.",
  "chatbox.test.text.11": "Additionally, the NeoForge version provides KubeJS integration. You can use the module's exposed interfaces to implement functions similar to the provided commands, and use the module's events for more flexible dialog configuration.",
  "chatbox.test.text.12": "For more detailed tutorials and JSON file generation for dialog data packs, please visit the module's Wiki page.",
  "chatbox.test.option.1": "Locked Option",
  "chatbox.test.option.2": "Unlocked Option, triggers command when selected",
  "chatbox.test.option.3": "Option 3",
  "chatbox.test.option.4": "Locked Option",
  "chatbox.test.option.5": "Unlocked Option, triggers command when selected",
  "chatbox.test.option.6": "Set weather to rainy",
  "chatbox.test.option.7": "Set weather to clear",
  "chatbox.test.option.8": "Set weather to thunder",
  "chatbox.test.tooltip.1": "It seems some mysterious ritual is required to unlock this option."
}